In [1]:
import pandas as pd

In [3]:
training_set = pd.read_csv("../data/datasets/visits_sp_unique_train_positivo_1000_random_0.csv")

In [4]:
testing_set = pd.read_csv("../data/datasets/visits_sp_unique_test_positivo_1000_random_0.csv")

In [5]:
testing_set_with_change = pd.read_csv("../data/datasets/visits_sp_changed_test_positivo_1000_random_0.csv")

In [17]:
c = ["T2D","AGE", "mo_t2d", "fa_t2d", "sex"]

In [51]:
training_set[["T2D","AGE"]].groupby(["T2D"]).describe()

        AGE
      count       mean        std   min   25%   50%   75%   max
T2D
0    1387.0  38.344629  16.554978  15.0  24.0  36.0  49.0  97.0
1     405.0  55.229630  14.100035  18.0  46.0  54.0  66.0  92.0

In [67]:
testing_set[["T2D","AGE"]].groupby(["T2D"]).describe()

       AGE
     count       mean        std   min   25%   50%    75%   max
T2D
0    394.0  47.789340  12.811564  28.0  37.0  45.0  58.00  86.0
1    156.0  48.564103  12.351403  20.0  40.0  50.0  56.25  85.0

In [23]:
testing_set_with_change[c].groupby("T2D").count()

     AGE  mo_t2d  fa_t2d  sex
T2D
0    200     200     200  200
1    212     212     212  212

In [66]:
len(testing_set_with_change['id'].unique())

103